Azure/embedded-wireless-framework/examples/PIC32CM_LS60/ewf_pic32cmls60_curiosity_bg96/NonSecure/firmware/src/packs/PIC32CM5164LS60100_DFP/component/tcc.h
#define TCC_WAVE_WAVEGEN_Pos                  _UINT32_(0)                                          /* (TCC_WAVE) Waveform Generation Position */
#define TCC_WAVE_WAVEGEN_Msk                  (_UINT32_(0x7) << TCC_WAVE_WAVEGEN_Pos)              /* (TCC_WAVE) Waveform Generation Mask */
#define TCC_WAVE_WAVEGEN(value)               (TCC_WAVE_WAVEGEN_Msk & (_UINT32_(value) << TCC_WAVE_WAVEGEN_Pos)) /* Assigment of value for WAVEGEN in the TCC_WAVE register */
#define   TCC_WAVE_WAVEGEN_NFRQ_Val           _UINT32_(0x0)                                        /* (TCC_WAVE) Normal frequency  */
#define   TCC_WAVE_WAVEGEN_MFRQ_Val           _UINT32_(0x1)                                        /* (TCC_WAVE) Match frequency  */
#define   TCC_WAVE_WAVEGEN_NPWM_Val           _UINT32_(0x2)                                        /* (TCC_WAVE) Normal PWM  */
#define   TCC_WAVE_WAVEGEN_DPWM_Val           _UINT32_(0x3)                                        /* (TCC_WAVE) Dual compare PWM  */
#define   TCC_WAVE_WAVEGEN_DSCRITICAL_Val     _UINT32_(0x4)                                        /* (TCC_WAVE) Dual-slope critical  */
#define   TCC_WAVE_WAVEGEN_DSBOTTOM_Val       _UINT32_(0x5)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO  */
#define   TCC_WAVE_WAVEGEN_DSBOTH_Val         _UINT32_(0x6)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP  */
#define   TCC_WAVE_WAVEGEN_DSTOP_Val          _UINT32_(0x7)                                        /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches TOP  */
#define TCC_WAVE_WAVEGEN_NFRQ                 (TCC_WAVE_WAVEGEN_NFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal frequency Position  */
#define TCC_WAVE_WAVEGEN_MFRQ                 (TCC_WAVE_WAVEGEN_MFRQ_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Match frequency Position  */
#define TCC_WAVE_WAVEGEN_NPWM                 (TCC_WAVE_WAVEGEN_NPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Normal PWM Position  */
#define TCC_WAVE_WAVEGEN_DPWM                 (TCC_WAVE_WAVEGEN_DPWM_Val << TCC_WAVE_WAVEGEN_Pos)  /* (TCC_WAVE) Dual compare PWM Position  */
#define TCC_WAVE_WAVEGEN_DSCRITICAL           (TCC_WAVE_WAVEGEN_DSCRITICAL_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope critical Position  */
#define TCC_WAVE_WAVEGEN_DSBOTTOM             (TCC_WAVE_WAVEGEN_DSBOTTOM_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO Position  */
#define TCC_WAVE_WAVEGEN_DSBOTH               (TCC_WAVE_WAVEGEN_DSBOTH_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP Position  */
#define TCC_WAVE_WAVEGEN_DSTOP                (TCC_WAVE_WAVEGEN_DSTOP_Val << TCC_WAVE_WAVEGEN_Pos) /* (TCC_WAVE) Dual-slope with interrupt/event condition when COUNT reaches TOP Position  */
#define TCC_WAVE_RAMP_Pos                     _UINT32_(4)                                          /* (TCC_WAVE) Ramp Mode Position */
#define TCC_WAVE_RAMP_Msk                     (_UINT32_(0x7) << TCC_WAVE_RAMP_Pos)                 /* (TCC_WAVE) Ramp Mode Mask */
#define TCC_WAVE_RAMP(value)                  (TCC_WAVE_RAMP_Msk & (_UINT32_(value) << TCC_WAVE_RAMP_Pos)) /* Assigment of value for RAMP in the TCC_WAVE register */
#define   TCC_WAVE_RAMP_RAMP1_Val             _UINT32_(0x0)                                        /* (TCC_WAVE) RAMP1 operation  */
#define   TCC_WAVE_RAMP_RAMP2A_Val            _UINT32_(0x1)                                        /* (TCC_WAVE) Alternative RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2_Val             _UINT32_(0x2)                                        /* (TCC_WAVE) RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2C_Val            _UINT32_(0x3)                                        /* (TCC_WAVE) Critical RAMP2 operation  */
#define   TCC_WAVE_RAMP_RAMP2CS_Val           _UINT32_(0x4)                                        /* (TCC_WAVE) Critical Swapped RAMP2 operation  */
#define TCC_WAVE_RAMP_RAMP1                   (TCC_WAVE_RAMP_RAMP1_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP1 operation Position  */
#define TCC_WAVE_RAMP_RAMP2A                  (TCC_WAVE_RAMP_RAMP2A_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Alternative RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2                   (TCC_WAVE_RAMP_RAMP2_Val << TCC_WAVE_RAMP_Pos)       /* (TCC_WAVE) RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2C                  (TCC_WAVE_RAMP_RAMP2C_Val << TCC_WAVE_RAMP_Pos)      /* (TCC_WAVE) Critical RAMP2 operation Position  */
#define TCC_WAVE_RAMP_RAMP2CS                 (TCC_WAVE_RAMP_RAMP2CS_Val << TCC_WAVE_RAMP_Pos)     /* (TCC_WAVE) Critical Swapped RAMP2 operation Position  */
#define TCC_WAVE_CIPEREN_Pos                  _UINT32_(7)                                          /* (TCC_WAVE) Circular period Enable Position */
#define TCC_WAVE_CIPEREN_Msk                  (_UINT32_(0x1) << TCC_WAVE_CIPEREN_Pos)              /* (TCC_WAVE) Circular period Enable Mask */
#define TCC_WAVE_CIPEREN(value)               (TCC_WAVE_CIPEREN_Msk & (_UINT32_(value) << TCC_WAVE_CIPEREN_Pos)) /* Assigment of value for CIPEREN in the TCC_WAVE register */
#define TCC_WAVE_CICCEN0_Pos                  _UINT32_(8)                                          /* (TCC_WAVE) Circular Channel 0 Enable Position */
#define TCC_WAVE_CICCEN0_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN0_Pos)              /* (TCC_WAVE) Circular Channel 0 Enable Mask */
#define TCC_WAVE_CICCEN0(value)               (TCC_WAVE_CICCEN0_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN0_Pos)) /* Assigment of value for CICCEN0 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN1_Pos                  _UINT32_(9)                                          /* (TCC_WAVE) Circular Channel 1 Enable Position */
#define TCC_WAVE_CICCEN1_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN1_Pos)              /* (TCC_WAVE) Circular Channel 1 Enable Mask */
#define TCC_WAVE_CICCEN1(value)               (TCC_WAVE_CICCEN1_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN1_Pos)) /* Assigment of value for CICCEN1 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN2_Pos                  _UINT32_(10)                                         /* (TCC_WAVE) Circular Channel 2 Enable Position */
#define TCC_WAVE_CICCEN2_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN2_Pos)              /* (TCC_WAVE) Circular Channel 2 Enable Mask */
#define TCC_WAVE_CICCEN2(value)               (TCC_WAVE_CICCEN2_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN2_Pos)) /* Assigment of value for CICCEN2 in the TCC_WAVE register */
#define TCC_WAVE_CICCEN3_Pos                  _UINT32_(11)                                         /* (TCC_WAVE) Circular Channel 3 Enable Position */
#define TCC_WAVE_CICCEN3_Msk                  (_UINT32_(0x1) << TCC_WAVE_CICCEN3_Pos)              /* (TCC_WAVE) Circular Channel 3 Enable Mask */
#define TCC_WAVE_CICCEN3(value)               (TCC_WAVE_CICCEN3_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN3_Pos)) /* Assigment of value for CICCEN3 in the TCC_WAVE register */
#define TCC_WAVE_POL0_Pos                     _UINT32_(16)                                         /* (TCC_WAVE) Channel 0 Polarity Position */
#define TCC_WAVE_POL0_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL0_Pos)                 /* (TCC_WAVE) Channel 0 Polarity Mask */
#define TCC_WAVE_POL0(value)                  (TCC_WAVE_POL0_Msk & (_UINT32_(value) << TCC_WAVE_POL0_Pos)) /* Assigment of value for POL0 in the TCC_WAVE register */
#define   TCC_WAVE_POL0_SINGLESLOPEPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL0_SINGLESLOPEPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL0_DUALSLOPEPOL0_Val     _UINT32_(0x0)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL0_DUALSLOPEPOL1_Val     _UINT32_(0x1)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL0_DUALCOMPAREPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL0_DUALCOMPAREPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1  */
#define TCC_WAVE_POL0_SINGLESLOPEPOL0         (TCC_WAVE_POL0_SINGLESLOPEPOL0_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL0_SINGLESLOPEPOL1         (TCC_WAVE_POL0_SINGLESLOPEPOL1_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL0_DUALSLOPEPOL0           (TCC_WAVE_POL0_DUALSLOPEPOL0_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL0_DUALSLOPEPOL1           (TCC_WAVE_POL0_DUALSLOPEPOL1_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL0_DUALCOMPAREPOL0         (TCC_WAVE_POL0_DUALCOMPAREPOL0_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL0_DUALCOMPAREPOL1         (TCC_WAVE_POL0_DUALCOMPAREPOL1_Val << TCC_WAVE_POL0_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL1_Pos                     _UINT32_(17)                                         /* (TCC_WAVE) Channel 1 Polarity Position */
#define TCC_WAVE_POL1_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL1_Pos)                 /* (TCC_WAVE) Channel 1 Polarity Mask */
#define TCC_WAVE_POL1(value)                  (TCC_WAVE_POL1_Msk & (_UINT32_(value) << TCC_WAVE_POL1_Pos)) /* Assigment of value for POL1 in the TCC_WAVE register */
#define   TCC_WAVE_POL1_SINGLESLOPEPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL1_SINGLESLOPEPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL1_DUALSLOPEPOL0_Val     _UINT32_(0x0)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL1_DUALSLOPEPOL1_Val     _UINT32_(0x1)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL1_DUALCOMPAREPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL1_DUALCOMPAREPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1  */
#define TCC_WAVE_POL1_SINGLESLOPEPOL0         (TCC_WAVE_POL1_SINGLESLOPEPOL0_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL1_SINGLESLOPEPOL1         (TCC_WAVE_POL1_SINGLESLOPEPOL1_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL1_DUALSLOPEPOL0           (TCC_WAVE_POL1_DUALSLOPEPOL0_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL1_DUALSLOPEPOL1           (TCC_WAVE_POL1_DUALSLOPEPOL1_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL1_DUALCOMPAREPOL0         (TCC_WAVE_POL1_DUALCOMPAREPOL0_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL1_DUALCOMPAREPOL1         (TCC_WAVE_POL1_DUALCOMPAREPOL1_Val << TCC_WAVE_POL1_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL2_Pos                     _UINT32_(18)                                         /* (TCC_WAVE) Channel 2 Polarity Position */
#define TCC_WAVE_POL2_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL2_Pos)                 /* (TCC_WAVE) Channel 2 Polarity Mask */
#define TCC_WAVE_POL2(value)                  (TCC_WAVE_POL2_Msk & (_UINT32_(value) << TCC_WAVE_POL2_Pos)) /* Assigment of value for POL2 in the TCC_WAVE register */
#define   TCC_WAVE_POL2_SINGLESLOPEPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL2_SINGLESLOPEPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL2_DUALSLOPEPOL0_Val     _UINT32_(0x0)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL2_DUALSLOPEPOL1_Val     _UINT32_(0x1)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL2_DUALCOMPAREPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL2_DUALCOMPAREPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1  */
#define TCC_WAVE_POL2_SINGLESLOPEPOL0         (TCC_WAVE_POL2_SINGLESLOPEPOL0_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL2_SINGLESLOPEPOL1         (TCC_WAVE_POL2_SINGLESLOPEPOL1_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL2_DUALSLOPEPOL0           (TCC_WAVE_POL2_DUALSLOPEPOL0_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL2_DUALSLOPEPOL1           (TCC_WAVE_POL2_DUALSLOPEPOL1_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL2_DUALCOMPAREPOL0         (TCC_WAVE_POL2_DUALCOMPAREPOL0_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL2_DUALCOMPAREPOL1         (TCC_WAVE_POL2_DUALCOMPAREPOL1_Val << TCC_WAVE_POL2_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL3_Pos                     _UINT32_(19)                                         /* (TCC_WAVE) Channel 3 Polarity Position */
#define TCC_WAVE_POL3_Msk                     (_UINT32_(0x1) << TCC_WAVE_POL3_Pos)                 /* (TCC_WAVE) Channel 3 Polarity Mask */
#define TCC_WAVE_POL3(value)                  (TCC_WAVE_POL3_Msk & (_UINT32_(value) << TCC_WAVE_POL3_Pos)) /* Assigment of value for POL3 in the TCC_WAVE register */
#define   TCC_WAVE_POL3_SINGLESLOPEPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL3_SINGLESLOPEPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL3_DUALSLOPEPOL0_Val     _UINT32_(0x0)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL3_DUALSLOPEPOL1_Val     _UINT32_(0x1)                                        /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1  */
#define   TCC_WAVE_POL3_DUALCOMPAREPOL0_Val   _UINT32_(0x0)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0  */
#define   TCC_WAVE_POL3_DUALCOMPAREPOL1_Val   _UINT32_(0x1)                                        /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1  */
#define TCC_WAVE_POL3_SINGLESLOPEPOL0         (TCC_WAVE_POL3_SINGLESLOPEPOL0_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL3_SINGLESLOPEPOL1         (TCC_WAVE_POL3_SINGLESLOPEPOL1_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Single-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL3_DUALSLOPEPOL0           (TCC_WAVE_POL3_DUALSLOPEPOL0_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL3_DUALSLOPEPOL1           (TCC_WAVE_POL3_DUALSLOPEPOL1_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Dual-slope PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_POL3_DUALCOMPAREPOL0         (TCC_WAVE_POL3_DUALCOMPAREPOL0_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 0 Position  */
#define TCC_WAVE_POL3_DUALCOMPAREPOL1         (TCC_WAVE_POL3_DUALCOMPAREPOL1_Val << TCC_WAVE_POL3_Pos) /* (TCC_WAVE) Dual Compare PWM waveform generation Channel Polarity 1 Position  */
#define TCC_WAVE_SWAP0_Pos                    _UINT32_(24)                                         /* (TCC_WAVE) Swap DTI Output Pair 0 Position */
#define TCC_WAVE_SWAP0_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP0_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 0 Mask */
#define TCC_WAVE_SWAP0(value)                 (TCC_WAVE_SWAP0_Msk & (_UINT32_(value) << TCC_WAVE_SWAP0_Pos)) /* Assigment of value for SWAP0 in the TCC_WAVE register */
#define TCC_WAVE_SWAP1_Pos                    _UINT32_(25)                                         /* (TCC_WAVE) Swap DTI Output Pair 1 Position */
#define TCC_WAVE_SWAP1_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP1_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 1 Mask */
#define TCC_WAVE_SWAP1(value)                 (TCC_WAVE_SWAP1_Msk & (_UINT32_(value) << TCC_WAVE_SWAP1_Pos)) /* Assigment of value for SWAP1 in the TCC_WAVE register */
#define TCC_WAVE_SWAP2_Pos                    _UINT32_(26)                                         /* (TCC_WAVE) Swap DTI Output Pair 2 Position */
#define TCC_WAVE_SWAP2_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP2_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 2 Mask */
#define TCC_WAVE_SWAP2(value)                 (TCC_WAVE_SWAP2_Msk & (_UINT32_(value) << TCC_WAVE_SWAP2_Pos)) /* Assigment of value for SWAP2 in the TCC_WAVE register */
#define TCC_WAVE_SWAP3_Pos                    _UINT32_(27)                                         /* (TCC_WAVE) Swap DTI Output Pair 3 Position */
#define TCC_WAVE_SWAP3_Msk                    (_UINT32_(0x1) << TCC_WAVE_SWAP3_Pos)                /* (TCC_WAVE) Swap DTI Output Pair 3 Mask */
#define TCC_WAVE_SWAP3(value)                 (TCC_WAVE_SWAP3_Msk & (_UINT32_(value) << TCC_WAVE_SWAP3_Pos)) /* Assigment of value for SWAP3 in the TCC_WAVE register */
#define TCC_WAVE_Msk                          _UINT32_(0x0F0F0FF7)                                 /* (TCC_WAVE) Register Mask  */

#define TCC_WAVE_CICCEN_Pos                   _UINT32_(8)                                          /* (TCC_WAVE Position) Circular Channel x Enable */
#define TCC_WAVE_CICCEN_Msk                   (_UINT32_(0xF) << TCC_WAVE_CICCEN_Pos)               /* (TCC_WAVE Mask) CICCEN */
#define TCC_WAVE_CICCEN(value)                (TCC_WAVE_CICCEN_Msk & (_UINT32_(value) << TCC_WAVE_CICCEN_Pos)) 
#define TCC_WAVE_POL_Pos                      _UINT32_(16)                                         /* (TCC_WAVE Position) Channel x Polarity */
#define TCC_WAVE_POL_Msk                      (_UINT32_(0xF) << TCC_WAVE_POL_Pos)                  /* (TCC_WAVE Mask) POL */
#define TCC_WAVE_POL(value)                   (TCC_WAVE_POL_Msk & (_UINT32_(value) << TCC_WAVE_POL_Pos)) 
#define TCC_WAVE_SWAP_Pos                     _UINT32_(24)                                         /* (TCC_WAVE Position) Swap DTI Output Pair 3 */
#define TCC_WAVE_SWAP_Msk                     (_UINT32_(0xF) << TCC_WAVE_SWAP_Pos)                 /* (TCC_WAVE Mask) SWAP */
#define TCC_WAVE_SWAP(value)                  (TCC_WAVE_SWAP_Msk & (_UINT32_(value) << TCC_WAVE_SWAP_Pos)) 

/* -------- TCC_PER : (TCC Offset: 0x40) (R/W 32) Period -------- */
#define TCC_PER_RESETVALUE                    _UINT32_(0xFFFFFFFF)                                 /*  (TCC_PER) Period  Reset Value */

#define TCC_PER_PER_Pos                       _UINT32_(0)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_PER_Msk                       (_UINT32_(0xFFFFFF) << TCC_PER_PER_Pos)              /* (TCC_PER) Period Value Mask */
#define TCC_PER_PER(value)                    (TCC_PER_PER_Msk & (_UINT32_(value) << TCC_PER_PER_Pos)) /* Assigment of value for PER in the TCC_PER register */
#define TCC_PER_Msk                           _UINT32_(0x00FFFFFF)                                 /* (TCC_PER) Register Mask  */

/* DITH4 mode */
#define TCC_PER_DITH4_DITHER_Pos              _UINT32_(0)                                          /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH4_DITHER_Msk              (_UINT32_(0xF) << TCC_PER_DITH4_DITHER_Pos)          /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH4_DITHER(value)           (TCC_PER_DITH4_DITHER_Msk & (_UINT32_(value) << TCC_PER_DITH4_DITHER_Pos))
#define TCC_PER_DITH4_PER_Pos                 _UINT32_(4)                                          /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH4_PER_Msk                 (_UINT32_(0xFFFFF) << TCC_PER_DITH4_PER_Pos)         /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH4_PER(value)              (TCC_PER_DITH4_PER_Msk & (_UINT32_(value) << TCC_PER_DITH4_PER_Pos))
#define TCC_PER_DITH4_Msk                     _UINT32_(0x00FFFFFF)                                  /* (TCC_PER_DITH4) Register Mask  */

